<a href="https://colab.research.google.com/github/ShakilM26/employee-analysis.project/blob/main/project_employee.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np 
import seaborn as sns

In [ ]:
df = pd.read_csv('employee.csv')
df.head(5)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday
0,Paolina Amorine,Female,78413 Lakeland Alley,Canada,Royal Military College of Canada,Account Executive,Devpulse,$99147.62,visa-electron,$106898.63,Volvo,01/01/2000
1,Kimbra Curston,Female,4449 Amoth Street,Russia,Tomsk State University of Architecture and Bui...,Programmer Analyst IV,Meejo,$20090.01,bankcard,$103210.76,Toyota,25/08/1991
2,Terrance Vuitton,Male,0 Dawn Parkway,United States,University of North Carolina at Greensboro,Geologist II,Tagfeed,$22821.37,solo,$102610.26,NaN,09/02/1993
3,Dex Bradforth,Male,76082 Cherokee Point,Poland,Warsaw School of Information Technology,Senior Cost Accountant,Blogpad,$55572.79,instapayment,$348744.48,Oldsmobile,18/01/2005
4,Eydie Spoure,Female,6568 Glacier Hill Place,Poland,Pedagogical University of Bydgoszcz,Senior Developer,Linktype,$46588.59,mastercard,$306061.37,Buick,09/12/1993

# **Data Cleaning**

****Our dataset has null values. I will print only those columns that have null 
values.****

In [ ]:
df.columns[df.isnull().any()]

Index(['salary', 'balance', 'vehicle'], dtype='object')

In [ ]:
cols = df.columns[df.isnull().any()]
df[cols].isnull().sum()

salary     45
balance    58
vehicle    32
dtype: int64

**We can see that there is no numeric columns. But we know salary and balance col is numeric. So we have to make it numeric.**

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   full_name    1000 non-null   object
 1   gender       1000 non-null   object
 2   address      1000 non-null   object
 3   country      1000 non-null   object
 4   university   1000 non-null   object
 5   job_title    1000 non-null   object
 6   company      1000 non-null   object
 7   salary       955 non-null    object
 8   credit_card  1000 non-null   object
 9   balance      942 non-null    object
 10  vehicle      968 non-null    object
 11  birthday     1000 non-null   object
dtypes: object(12)
memory usage: 93.9+ KB

**We can't fill our values using median,mean or any other method. because there are '$' sign.**
**We have to get rid of it.**

In [ ]:
df['salary'] = df['salary'].replace(r'\$', r'', regex=True)

In [ ]:
df['balance'] = df['balance'].replace(r'\$', r'', regex=True)

In [ ]:
# Now check again and '$' sign is vanish. 
df.head(1)

,full_name,gender,address,country,university,job_title,company,salary,credit_card,balance,vehicle,birthday
0,Paolina Amorine,Female,78413 Lakeland Alley,Canada,Royal Military College of Canada,Account Executive,Devpulse,99147.62,visa-electron,106898.63,Volvo,01/01/2000

In [ ]:
# But still our columns is not numeric. Make it numeric.

df['salary'] = pd.to_numeric(df['salary'], errors='coerce')
df['balance'] = pd.to_numeric(df['balance'], errors='coerce')

In [ ]:
# make it integer. but still we have nan values and cannot convert float to integer.
# now fill our nan values

median_salary = df['salary'].median()
print(median_salary)

median_balance = df['balance'].median()
print(median_balance)

60931.67
265862.935